<template>
  <div class="produceIntro">
    <help :active="active" :navArr="navArr" @change="change"></help>
  </div>
</template>
<script type="text/ecmascript-6">
import Help from './help'
export default {
  name: 'produceIntro',
  components: {
    Help
  },
  data () {
    return {
      active: 0,
      navArr: [{
        title: '产品简介',
        contArr: [{
          h3Title: '产品概述',
          h3Arr: [{
            h4Title: '产品概述',
            cont: '短信服务（Short Message Service）是抱一云信为用户提供的一种通信服务的能力，支持快速发送短信验证码、短信通知等。通知短信到达率高达96%。'
          }]
        }, {
          h3Title: '产品优势',
          h3Arr: [{
            h4Title: '消息堆积处理',
            cont: '通过队列对用户任务请求压力实现削峰填谷，进而降低系统峰值压力。'
          }, {
            h4Title: '易开发管理',
            cont: '无需自行搭建消息服务，免运维提供多种语言SDK，包括JAVA、PHP、.NET、Node.JS任您选择'
          }]
        }, {
          h3Title: '产品功能',
          h3Arr: [{
            h4Title: '短信通知',
            cont: '96%到达率，电信级运维保障，实时监控自动切换。'
          }, {
            h4Title: '短信验证码',
            cont: '3秒可达，三网合一专属通道，与工信部携号转网平台实时互联。变量灵活，支持带入变量，内容灵活，可适应支持各业务场景'
          }, {
            h4Title: '营销短信',
            cont: '支持多种推广内容的短信发放，为提升企业产品增加曝光率提供帮助。业务推广、新产品宣讲、会员关怀等进行短信发送'
          }, {
            h4Title: '异步通知',
            cont: '可以后端服务处理完成任务时，回调通知用户。进而减少用户，Web前端和后端服务之间大量不必要的轮询请求。'
          }, {
            h4Title: '数据统计',
            cont: '可查看请求量、发送成功量、失败量、等统计数据；通过日期、手机号等维度，查看发送详情。'
          }]
        }]
      }, {
        title: '产品业务规则',
        contArr: [{
          h3Title: '产品业务规则',
          h3Arr: [{
            h4Title: '短信内容长度计算规则',
            cont: '·短信字数＝短信模板内容字数 + 签名字数'
          }, {
            h4Title: '',
            cont: '·短信字数<=70个字数，按照70个字数一条短信计算'
          }, {
            h4Title: '',
            cont: '·短信字数>70个字数，即为长短信，按照67个字数记为一条短信计算'
          }, {
            h4Title: '',
            cont: '注：在统计短信字数时，小数点、字母、汉字以及其他符号均按照一个字符位进行统计。最终按照实际发送成功的短信条数计费'
          }, {
            h4Title: '短信发送失败，还是会扣费吗？',
            cont: '接口调用失败及运营商返回失败状态，都不会扣费'
          }, {
            h4Title: '短信发送频率限制',
            cont: '·短信验证码 ：使用同一个签名，对同一个手机号码发送短信验证码，2条/分钟，5条/小时，10条/天（天的计算方式是是当下时间往后推24小时，例如2017年8月24 日：11:00发送一条验证码短信，计算限流方式是2017年8月23日11:00点到8月24日：11:00点，是否满10条）。如您是在发送验证码时提示业务限流，建议您根据 以上业务调整接口调用时间'
          }, {
            h4Title: '',
            cont: '·短信通知： 使用同一个签名和同一个短信模板ID，对同一个手机号码发送短信通知，支持50条/天（天的计算方式是是当下时间往后推24小时，例如2017年8月24 日：11:00发送一条短信，计算限流方式是2017年8月23日11:00点到8月24日：11:00点，是否满50条）。如您是在发送验证码时提示业务限流，建议您根据 以上业务调整接口调用时间； '
          }, {
            h4Title: '',
            cont: '·推广短信： 使用同一个签名和同一个短信模板ID，对同一个手机号码发送短信通知，支持50条/天；内容相同的营销短信一天最多接收两条（天的计算方式是是当下 时间往后推24小时，例如2017年8月24日：11:00发送一条短信，计算限流方式是2017年8月23日11:00点到8月24日：11:00点，是否满50条）。如您是在发送验证码 时提示业务限流，建议您根据以上业务调整接口调用时间；'
          }, {
            h4Title: '短信显示号码及显号规则',
            cont: '·手机端接收显示的号码是106开头的正规号码 '
          }, {
            h4Title: '',
            cont: '·显号规则：'
          }, {
            h4Title: '',
            cont: '号码＝通道号＋扩展码；'
          }, {
            h4Title: '',
            cont: '在通道不稳定、网络抖动及机房断电等不可抗拒的因素下，为确保到达率及到达时间，会自动切换通道，通道号会发生变化。'
          }, {
            h4Title: '短信提供哪些功能?',
            cont: '·目前支持短信下行发送、短信状态报告回执、帐单/报表查询等；'
          }, {
            h4Title: '',
            cont: '·短信上行功能。上行功能免费,但上行产生的通讯费,由运营商向终端用户收取.'
          }, {
            h4Title: '短信字数最多能发多少个字？',
            cont: '最大支持发送160字以内的短信。（若长短信发送失败请联系技术支持）'
          }, {
            h4Title: '发送短信验证码为什么数字后面会出现“.0”？',
            cont: 'json格式请使用string类型'
          }, {
            h4Title: '支持同时发多个手机吗？',
            cont: '·支持，API一次最多可提交1W个手机号码；（温馨提示：手机号以英文逗号分开） '
          }, {
            h4Title: '',
            cont: '·支持，控制台一次最多可提交10W个手机号码；（温馨提示：目前仅支持csv和xlsx文件上传）'
          }, {
            h4Title: '短信发送状态回执哪里查看？',
            cont: '请参考消息API使用流程；温馨提示：先在控制台配置回执地址'
          }]
        }, {
          h3Title: '怎么区分系统短信与营销短信',
          h3Arr: [{
            h4Title: '系统短信：即行业短信，通常是由用户主动触发后收到的短信内容或者有明确的发送目标。内容一般为验证码信息、告警通知等不带营销字眼的短信。',
            cont: ' 验证码示例：验证码${' + 'cond' + '}，您正进行支付宝的身份验证，如非本人操作，请忽略本短信！ '
          }, {
            h4Title: '',
            cont: '短信通知示例：尊敬的买家您好，您的货物已发货，单号为：${' + 'name' + '},请查收~~~'
          }, {
            h4Title: '营销短信：指短信内容一般为经营性公司向网站、公司注册会员下发促销、会员活动信息等明显营销类推广短信。',
            cont: '营销短信示例：好消息！奇点云信年中折扣，推广短信+系统短信，助力中小企业低成本搭建更高效的短信服务。！回T退订'
          }]
        }]
      }, {
        title: '名词解释',
        contArr: [{
          h3Title: '名词解释',
          h3Arr: [{
            h4Title: '短信签名',
            cont: '·根据用户属性来创建符合自身属性的签名信息。企业用户需要上传相关企业资质证明。 '
          }, {
            h4Title: '',
            cont: '·短信签名需要审核通过后才可以使用 '
          }, {
            h4Title: '',
            cont: '',
            ege: '示例：'
          }, {
            h4Title: '',
            cont: '',
            ege: '短信示例：【抱一云信 】 验证码${' + 'number' + '}，您正进行奇点掌柜的身份验证，打死不告诉别人！'
          }, {
            h4Title: '',
            cont: '',
            ege: '短信签名：抱一云信'
          }, {
            h4Title: '',
            cont: '',
            ege: '短信模板: 验证码${' + 'number' + '}，您正进行奇点掌柜的身份验证，打死不告诉别人！'
          }, {
            h4Title: '短信模板',
            cont: '·短信模板，即具体发送的短信内容。 '
          }, {
            h4Title: '',
            cont: '·短信模板可以支持验证码、短信通知、推广短信三种模式。当前短信模板为全变量模板'
          }, {
            h4Title: '',
            cont: '',
            ege: '示例：'
          }, {
            h4Title: '',
            cont: '',
            ege: '短信示例：【抱一云信 】 验证码${' + 'number' + '}，您正进行奇点掌柜的身份验证，打死不告诉别人！  '
          }, {
            h4Title: '',
            cont: '',
            ege: '短信签名：抱一云信'
          }, {
            h4Title: '',
            cont: '',
            ege: '短信模板: 验证码${' + 'number' + '}，您正进行奇点掌柜的身份验证，打死不告诉别人！'
          }, {
            h4Title: '不同审核状态的说明',
            cont: '·短信签名提交审核后，会显示具体的状态。 '
          }, {
            h4Title: '',
            cont: '·短信签名状态包括：审核中、审核未通过、审核通过。  '
          }, {
            h4Title: '',
            cont: 'a.审核中：当前已提交了短信签名，正在排队等待审核，2小时内会审核完毕。  '
          }, {
            h4Title: '',
            cont: 'b.审核通过：已通过了审核，短信签名和短信模板都通过审核时，就可以通过接口调取开始发送短信。'
          }, {
            h4Title: '',
            cont: 'c.审核未通过：由于某些原因，签名审核未能通过。可以通过控制台“签名管理”来查看具体审核未通过的原因。  '
          }]
        }]
      }]
    }
  },
  methods: {
    change (i) {
      this.active = i
    }
  }
}
</script>
<style lang="stylus" rel="stylesheet/stylus" scoped>
</style>